package com.company;
import java.io. *;

public class Main {


    public static void main(String[] args){
        System.out.format("Город: %s; Население: %d; Процент безработных: %d; \n", "москва", 2133, 10 );
        System.out.format("Секция на трибуне: %c; Место: %d; Стоимость билета: %d;\n", 'а', 12, 1020 );
        System.out.format("Имя: %s; Возраст: %d; Рост: %d;\n", "Aлла", 22, 167 );
        System.out.format("%c%d%c%c  Рост: %d;\n", 'А',123,'А','А', 167 );
        System.out.format("Название компании: %s; Годовой доход: %d; Доля на рынке: %f;\n", "ООО Василек", 22000, 1.2);
        System.out.format("Резус фактор: %c; Группа крови: %d; Доля людей с этой группой крови: %d;\n", 'а', 1, 167 );
        System.out.format("Название университета: %s; Число студентов: %d; Доля отчисленных: %f;\n", "политех", 12, 1.2 );
        System.out.format("Рейтинг фильма: %c; Копий продано: %d; Рейтинг: %f;\n", 'C', 112, 2.3 );
        System.out.format("Название бренда:%s; Произведено товаров: %d; Процент продаж: %f;\n", "BMW", 112, 2.3 );
        System.out.format("Категория товара:%c; Штрих код: %d; Процент покупателей старше 30: %f;\n", 'D', 2233, 0.10 );


    }
}
